<template>
    <div class="content">
        <p>Автопоилка: {{getAutoWateringValue()}}</p>

        <div class="more">
            <header>Подробности:</header>
            <p>
                Потребление воды имеет непосредственное отношение к количеству корма. Так, соотношение вода: корм у кур несушек составляет 2,5 к 1, у бройлеров и молодок 1,4-1,6 к 1.

                Увеличить объем воды необходимо также и при добавлении в корм соли, мелассы, шроты и в том случае, когда в корме содержится большое количество протеина и клетчатки.

                огда температура воздуха повышается, куры начинают ощущать нехватку жидкости в организме.

                Профессиональные птицеводы выявили объем воды, который употребляют куры при определенной температуре.

                Так, бройлеры при +18°С выпивают примерно 170 мл жидкости на единицу массы, куры несушки – около 200 мл. Если температура воздуха составляет +30 градусов, количество потребляемой воды вырастет в 2-3 раза.

                Оптимальная температура для содержания кур +21 градус. В этих условиях птица может съесть около 120 г корма и выпить 200 г воды (1 голова).


            </p>
        </div>
    </div>
</template>

<script>
    export default {
        name: "ChickenCoopPage",
        props: { device: Object },
        methods: {
            getAutoWateringValue() {
                if(this.device.additional.auto_watering)
                    return "включена"
                return "выключена"
            }
        }
    }
</script>

<style scoped>
    .content {
        text-align: justify;
    }

    .more {
        margin-bottom: 3em;
    }

    .more header {
        font-weight: 700;
    }

    .more p {
        margin: 0.1em 0.3em;
    }
</style>