<template>
<!--    <p>Температура воздуха: {{ device.additional.temperature }} °C</p>-->
<!--    <p>Давление: {{ device.additional.air_pressure }}мм рт ст</p>-->
    <div class="content">
        <p>Текущая температура воздуха:</p>
        <div class="temperature">
            {{ device.additional.temperature }}°C
        </div>

        <div class="more">
            <header>Подробности:</header>
            <p>
                Указанный ГОСТ в зависимости от назначения помещения определяет допустимые значения температуры воздуха в жилых помещениях: от 18 до 25 градусов Цельсия.

                Так, например, если, по общему правилу, температура воздуха в жилой комнате квартире должны быть не менее 18 градусов Цельсия, то температура воздуха в ванной или совмещенном помещении уборной и ванной должна быть 25 градусов Цельсия.

                Допустимая температура воздуха в вестибюле, лестничной клетке, общем коридоре в квартирном доме составляет 16 градусов.

                Батареи должны прогревать помещение до указанных выше величин. В противном случае жильцы вправе рассчитывать на перерасчет платы за коммунальные услуги. Допустимое отклонение температуры воды в батареях в дневное время: 3° С. В ночное время суток (с 00:00 до 05:00) — до 5° С. Большее снижение температуры не допускается за исключением аварийных ситуаций.
            </p>
        </div>

        <p>Давление:</p>
        <div class="temperature">
            {{ device.additional.air_pressure }}мм рт ст
        </div>

        <div class="more">
            <header>Подробности:</header>
            <p>
                Я лично без понятия какое давление рекомендовано
            </p>
        </div>

        <p>Влажность:</p>
        <div class="temperature">
            {{ device.additional.air_humidity }}%
        </div>

        <div class="more">
            <header>Подробности:</header>
            <p>
                Разобраться, какая влажность должна быть в квартире, помогут разработанные на основе ГОСТ 30494-96 нормы. Согласно соответствующим статьям в СНиП и СанПиН, допустимый уровень зависит от времени года:

                в отопительный сезон нормой влажности в квартире считается значение до 45% при допустимом максимуме 60%;
                когда центральное отопление отключено, нормальной влажностью в квартире считают 30-60% при допустимом максимуме 65%            </p>
        </div>

    </div>
</template>

<script>
    export default {
        name: "WeatherStationPage",
        props: { device: Object },
    }
</script>

<style scoped>
    .content {
        text-align: justify;
    }

    .temperature {
        font-size: 3.2em;
    }

    .more {
        margin-bottom: 3em;
    }

    .more header {
        font-weight: 700;
    }

    .more p {
        margin: 0.1em 0.3em;
    }
</style>